Tekla Open API Reference for Tekla Structures 2025
ControlCircle Constructor
 Initializes a new instance of the ControlCircle class.
 The default values are as follows:
 Color = ControlCircleColorEnum.YELLOW;
 Extension = 0.0;
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlCircle()
Public Sub New
See Also
Reference
ControlCircle Class
ControlCircle Overload
Tekla.Structures.Model Namespace